// !!! Строгая типизация
#include <iostream> // библиотека С++ для работы с консольным вводом/выводом
#include <fstream> // библиотека С++ для работы с файлами = потоки данных
using namespace std;
int main()
{
    // объявление переменных = определяем тип, к которому относится объект
    // + даем имя объекту + выделяем ресурсы (память) для хранения объекта

    // тип_данных имя_переменной;
    char a = -119, b = 119;
    int a1 = -119, b1 = 119;
    float fp1 = 5.25, fn1 = -5.25, fp2 = 5.33, fn2 = -5.33;
    // бинарные файлы хранят информацию как в оперативной памяти
    // !!! не выполняется пробразование
    ofstream output("/home/u614/tsarina/firstApp/data.txt", ios::binary); // создали файл
    // открыли его для записи
    output.write((char *)&fp1, sizeof(float)); // записали в файл
    output.write((char *)&fn1, sizeof(float)); // записали в файл
    output.write((char *)&fp2, sizeof(float)); // записали в файл
    output.write((char *)&fn2, sizeof(float)); // записали в файл
    // значение, которое было в оперативной памяти там, где
    // находится переменная a
    output.close();

    // window 1251
    bool flag = true; // false;
    // void  - безтиповый (обозначение отсутствия результата)
    auto variable = 5.5f;

}
