int main(){
    // арифметические
    // +, - , *, / , %
    float f1 = 4.5f, f2 = 2;
    auto res = f1 / f2;
    int i1 = 5, i2 = 2;
    auto res_i = i1 / f2;
    double data = 1.0/3.0;

    // логические
    // && - и, || - или, ! - не
    char ch = '5';
    if(ch>='0' && ch <='9'){
        ch++; // ch += 7;
    }
    else{
        ch--; // ch -= 1;
    }
    // ==, !=

    // битовые операторы
    int a = 10;
    a = a << 3; // сдвиг влево битов на 3 позиции
    a = a >> 1; // сдвиг вправо на 1 позицию
    // &, |, ~
    return 0;
}